
# Descriptive Statistics

# identitas 

NAMA : Cintya Aprila Fandini
NIM  : 2041720049

<h2>Daftar Isi</h2>

<div class="alert alert-block alert-info" style="margin-top: 20px">
<ol>
    <li><a href="#import_data">Melakukan Import Data</a></li>
    <li><a href="#descriptive_statistics">Analisis Descriptive Statistics</a></li>
</ol>

</div>
 
<hr>

<h3> Fitur atau kolom apa yang menjadi karakteristik dari harga mobil?</h3>

jawaban : jenis mobil dan harga per unit

<h2 id="import_data">1. Import Data from Module 2</h2>

<h4>Setup</h4>

 Import libraries

In [1]:
import pandas as pd
import numpy as np

 <p>load data dan menyimpan didalam dataframe df:</p>

In [3]:
path='Top250.csv'
df = pd.read_csv(path)
df.head()

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken
3,4,Taco Bell,NaN,11293,9.0%,6766,2.7%,NaN,Quick Service & Mexican
4,5,Burger King,NaN,10204,2.7%,7346,0.2%,NaN,Quick Service & Burger

<h2 id="pattern_visualization">2. Analisis Fitur Individual</h2>

<p>Kita dapat melakukan instalasi seaborn dengan cara berikut</p>

In [4]:
%%capture
! pip install seaborn

Import visualization packages "Matplotlib" dan "Seaborn", jangan lupa "%matplotlib inline" untuk melakukan plotting pada Jupyter notebook.

In [5]:
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline


<h4>Pertama-tama kita harus mengetahui jenis-jenis tipe data dari masing-masing variabel</h4>

In [6]:
print(df.dtypes)

Rank                 int64
Restaurant          object
Content             object
Sales                int64
YOY_Sales           object
Units                int64
YOY_Units           object
Headquarters        object
Segment_Category    object
dtype: object

<div class="alert alert-danger alertdanger" style="margin-top: 20px">
<h3>Pertanyaan  #1:</h3>

<b>Apakah tipe data dari "YOY_Sales"? </b>

</div>

Double-click <b>disini</b> untuk solusinya.

<!--berikut adalah jawabanya:

tipe datanya adalah object

-->

<p>Kita dapat menghitung korelasi antara variabel int64 dan float64 dengan method corr</p>

In [7]:
df.corr()

           Rank     Sales     Units
Rank   1.000000 -0.462349 -0.450929
Sales -0.462349  1.000000  0.780101
Units -0.450929  0.780101  1.000000

The diagonal elements are always one; we will study correlation more precisely Pearson correlation in-depth at the end of the notebook.

<div class="alert alert-danger alertdanger" style="margin-top: 20px">
<h1> Pertanyaan  #2: </h1>

<p>Carilah korelasi dari kolom-kolom berikut ini: rank, sales, units.</p>
<p>Petunjuk anda dapat menggunakan syntax berikut ini: df[['Rank','Sales','Units']]</p>
</div>

In [10]:
df[['Rank','Sales','Units']]

     Rank  Sales  Units
0       1  40412  13846
1       2  21380  15049
2       3  11320   2470
3       4  11293   6766
4       5  10204   7346
..    ...    ...    ...
245   246    129     18
246   247    127     56
247   248    127     25
248   249    126    270
249   250    126     40

[250 rows x 3 columns]

Double-click <b>disini</b> untuk solusinya.

The answer is below:

 untuk kodenya df[['Rank','Sales','Units']]

<h2 id="discriptive_statistics">2. Analisis Descriptive Statistics</h2>
<p> Pertama-tama kita lihat variable yang ada dengan meutilisasi method description</p>

<p>Method <b>describe</b> secara otomatis melakukan komputasi statistik untuk semua continous variable. Seluruh NaN akan ditidak dihitung didalam statistics.</p>

This will show:

<ul>
    <li>the count of that variable</li>
    <li>mean</li>
    <li>standard deviation (std)</li> 
    <li>nilai minimum</li>
    <li>IQR (Interquartile Range: 25%, 50% dan 75%)</li>
    <li>nilai maximum</li>
<ul>

 Kita dapat meutilisasi method "describe" seperti berikut ini:

In [11]:
df.describe()

             Rank        Sales         Units
count  250.000000    250.00000    250.000000
mean   125.500000   1242.74000    850.076000
std     72.312977   3365.22882   2296.151659
min      1.000000    126.00000     13.000000
25%     63.250000    181.00000     85.000000
50%    125.500000    330.00000    207.000000
75%    187.750000    724.75000    555.250000
max    250.000000  40412.00000  23801.000000

Secara default describe melakukan ignore terhada variabel bertype objek. Kita dapat menggunakan method describe pada variable object dengan cara sebagai berikut

In [12]:
df.describe(include=['object'])

,Restaurant,Content,YOY_Sales,YOY_Units,Headquarters,Segment_Category
count,250,33,250,250,52,250
unique,250,33,172,140,39,48
top,Smashburger,Cracker Barrel made the most surprising deal o...,2.2%,0.0%,"Dallas, TX",Varied Menu
freq,1,1,5,24,6,22


<h3>Value Counts</h3>
<p>Penghitungan nilai adalah cara yang baik untuk memahami berapa banyak unit dari setiap karakteristik/variabel yang kita miliki. Kita bisa menerapkan metode "value_counts" pada kolom 'drive-wheels'. Jangan lupa metode "value_counts" hanya berfungsi pada seri Pandas, bukan Pandas Dataframes. Sehingga, kita hanya menyertakan satu tanda kurung "df['drive-wheels']" bukan dua tanda kurung "df[['drive-wheels']]".</p>

In [18]:
df['YOY_Units'].value_counts()

0.0%     24
-0.5%     6
3.0%      5
2.2%      5
0.7%      5
         ..
-4.8%     1
-6.5%     1
5.5%      1
-8.1%     1
2.3%      1
Name: YOY_Units, Length: 140, dtype: int64

Kita dapat melakukan konversi kedalam dataframe dengan cara sebagai berikut :

In [19]:
df['YOY_Units'].value_counts().to_frame()

       YOY_Units
0.0%          24
-0.5%          6
3.0%           5
2.2%           5
0.7%           5
...          ...
-4.8%          1
-6.5%          1
5.5%           1
-8.1%          1
2.3%           1

[140 rows x 1 columns]

Mari ulangi langkah di atas tetapi simpan hasilnya ke dataframe "YOY_Units_counts" dan ganti nama kolom 'YOY_Units' menjadi 'value_counts'.

In [25]:
YOY_Units_counts = df['YOY_Units'].value_counts().to_frame()
YOY_Units_counts.rename(columns={'YOY_Units': 'value_counts'}, inplace=True)
YOY_Units_counts

       value_counts
0.0%             24
-0.5%             6
3.0%              5
2.2%              5
0.7%              5
...             ...
-4.8%             1
-6.5%             1
5.5%              1
-8.1%             1
2.3%              1

[140 rows x 1 columns]

Sekarang mari kita ganti nama indeks menjadi 'YOY_Units':

In [21]:
drive_wheels_counts.index.name = 'YOY_Units'
drive_wheels_counts

           value_counts
YOY_Units
0.0%                 24
-0.5%                 6
3.0%                  5
2.2%                  5
0.7%                  5
...                 ...
-4.8%                 1
-6.5%                 1
5.5%                  1
-8.1%                 1
2.3%                  1

[140 rows x 1 columns]

Kita dapat mengulangi proses di atas untuk variabel 'Headquarters'.

In [24]:
# Headquarters as variable
engine_loc_counts = df['Headquarters'].value_counts().to_frame()
engine_loc_counts.rename(columns={'Headquarters': 'value_counts'}, inplace=True)
engine_loc_counts.index.name = 'Headquarters'
engine_loc_counts.head(10)

                 value_counts
Headquarters
Dallas, TX                  6
Houston, TX                 3
Irving, TX                  3
Plano, TX                   2
Addison, TX                 2
Denver, CO                  2
Austin, TX                  2
Minnetonka, MN              1
Cheyenne, WY                1
Orange City, IA             1

#### References
Cognitive Class, Data Analysis with Python, Course Number: DA0101EN